Repository: xcv58/MacTools
Catalog: Sources/MacToolsPluginKit/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# keyboardKey.side.left
source: 左侧
ar: يسار
de: Links
en: Left
es: Izquierda
fr: Gauche
ja: 左
ko: 왼쪽
pt: Esquerda
ru: Слева
tr: Sol
zh_hant: 左側

# keyboardKey.side.right
source: 右侧
ar: يمين
de: Rechts
en: Right
es: Derecha
fr: Droite
ja: 右
ko: 오른쪽
pt: Direita
ru: Справа
tr: Sağ
zh_hant: 右側

# keyboardKeyTap.group.keypad
source: 数字键盘
ar: لوحة الأرقام
de: Ziffernblock
en: Keypad
es: Teclado numérico
fr: Pavé numérique
ja: テンキー
ko: 숫자 키패드
pt: Teclado numérico
ru: Цифровая клавиатура
tr: Sayı Tuş Takımı
zh_hant: 數字鍵盤

# keyboardKeyTap.group.modifiers
source: 修饰键
ar: مفاتيح التعديل
de: Sondertasten
en: Modifier Keys
es: Teclas modificadoras
fr: Touches de modification
ja: 修飾キー
ko: 보조 키
pt: Teclas modificadoras
ru: Клавиши-модификаторы
tr: Değiştirici Tuşlar
zh_hant: 修飾鍵

# keyboardKeyTap.group.navigation
source: 导航与编辑
ar: التنقل والتحرير
de: Navigation und Bearbeitung
en: Navigation & Editing
es: Navegación y edición
fr: Navigation et édition
ja: ナビゲーションと編集
ko: 탐색 및 편집
pt: Navegação e edição
ru: Навигация и редактирование
tr: Gezinme ve Düzenleme
zh_hant: 導覽與編輯

# keyboardKeyTap.group.other
source: 其他按键
ar: مفاتيح أخرى
de: Weitere Tasten
en: Other Keys
es: Otras teclas
fr: Autres touches
ja: その他のキー
ko: 기타 키
pt: Outras teclas
ru: Другие клавиши
tr: Diğer Tuşlar
zh_hant: 其他按鍵

# keyboardKeyTap.pickerHelp
source: 从列表中选择要发送的按键。
ar: اختر المفتاح المراد إرساله من القائمة.
de: Wähle die zu sendende Taste aus der Liste.
en: Choose the key to send from the list.
es: Elige en la lista la tecla que se enviará.
fr: Choisissez dans la liste la touche à envoyer.
ja: 送信するキーをリストから選択します。
ko: 목록에서 보낼 키를 선택하십시오.
pt: Escolha na lista a tecla a enviar.
ru: Выберите в списке клавишу для отправки.
tr: Gönderilecek tuşu listeden seçin.
zh_hant: 從列表中選擇要傳送的按鍵。

# keyboardKeyTap.unsupportedHelp
source: 不支持大写锁定和媒体键。
ar: مفتاح Caps Lock ومفاتيح الوسائط غير مدعومة.
de: Feststelltaste und Medientasten werden nicht unterstützt.
en: Caps Lock and media keys are not supported.
es: Bloq Mayús y las teclas multimedia no son compatibles.
fr: Verr. Maj. et les touches multimédias ne sont pas prises en charge.
ja: Caps Lockとメディアキーには対応していません。
ko: Caps Lock 및 미디어 키는 지원되지 않습니다.
pt: Caps Lock e teclas multimédia não são suportadas.
ru: Caps Lock и мультимедийные клавиши не поддерживаются.
tr: Caps Lock ve medya tuşları desteklenmez.
zh_hant: 不支援大寫鎖定和媒體鍵。

# keyboardKeyTap.unset
source: 未设置
ar: غير محدد
de: Nicht festgelegt
en: Not set
es: No establecido
fr: Non défini
ja: 未設定
ko: 설정되지 않음
pt: Não definido
ru: Не установлено
tr: Ayarlanmadı
zh_hant: 未設定

# action.error.failed
source: 操作未能完成。
ar: تعذر إكمال الإجراء.
de: Die Aktion konnte nicht abgeschlossen werden.
en: The action could not be completed.
es: No se pudo completar la acción.
fr: L’action n’a pas pu être effectuée.
ja: アクションを完了できませんでした。
ko: 동작을 완료할 수 없습니다.
pt: Não foi possível concluir a ação.
ru: Не удалось выполнить действие.
tr: Eylem tamamlanamadı.

# action.error.invalidParameters
source: 操作参数无效。
ar: معلمات الإجراء غير صالحة.
de: Die Aktionsparameter sind ungültig.
en: The action parameters are invalid.
es: Los parámetros de la acción no son válidos.
fr: Les paramètres de l’action ne sont pas valides.
ja: アクションのパラメータが無効です。
ko: 동작 매개변수가 올바르지 않습니다.
pt: Os parâmetros da ação são inválidos.
ru: Недопустимые параметры действия.
tr: Eylem parametreleri geçersiz.
zh_hant: 操作參數無效。

# action.error.unavailable
source: 操作不可用。
ar: الإجراء غير متاح.
de: Die Aktion ist nicht verfügbar.
en: The action is unavailable.
es: La acción no está disponible.
fr: L’action n’est pas disponible.
ja: アクションを利用できません。
ko: 동작을 사용할 수 없습니다.
pt: A ação não está disponível.
ru: Действие недоступно.
tr: Eylem kullanılamıyor.
zh_hant: 操作無法使用。

# shortcutRecorder.defaultPlaceholder
source: 未设置
ar: غير محدد
de: Nicht festgelegt
en: Not set
es: No establecido
fr: Non défini
ja: 未設定
ko: 설정되지 않음
pt: Não definido
ru: Не установлено
tr: Ayarlanmadı
zh_hant: 未設定

# shortcutRecorder.escHint
source: 按下 ESC 退出录制
ar: اضغط على Esc لإيقاف التسجيل
de: Drücken Sie Esc, um die Aufnahme zu stoppen
en: Press Esc to stop recording
es: Presiona Esc para detener la grabación
fr: Appuyez sur Échap pour arrêter l'enregistrement
ja: Esc キーを押して録音を停止します
ko: 녹화를 중지하려면 Esc를 누르세요
pt: Pressione Esc para parar a gravação
ru: Нажмите Esc, чтобы остановить запись
tr: Kaydı durdurmak için Esc tuşuna basın
zh_hant: 按下 ESC 退出錄製

# shortcutRecorder.helpFormat
source: 点击录制%@
ar: انقر للتسجيل %@
de: Klicken Sie, um %@ aufzuzeichnen
en: Click to record %@
es: Haga clic para grabar %@
fr: Cliquez pour enregistrer %@
ja: クリックして %@ を記録
ko: %@을(를) 녹음하려면 클릭하세요.
pt: Clique para registrar %@
ru: Нажмите, чтобы записать %@
tr: Kaydetmek için tıklayın: %@
zh_hant: 點擊錄製%@

# shortcutRecorder.previewPlaceholder
source: 按下录制快捷键
ar: اضغط على الاختصار
de: Drücken Sie eine Verknüpfung
en: Press a shortcut
es: Presiona un atajo
fr: Appuyez sur un raccourci
ja: ショートカットを押します
ko: 단축키 누르기
pt: Pressione um atalho
ru: Нажмите ярлык
tr: Bir kısayola basın
zh_hant: 按下錄製快速鍵

# shortcutValidation.duplicateFormat
source: 该快捷键已被“%@”占用。
ar: هذا الاختصار مستخدم بالفعل بواسطة "%@".
de: Diese Verknüpfung wird bereits von „%@“ verwendet.
en: This shortcut is already used by "%@".
es: Este acceso directo ya lo utiliza "%@".
fr: Ce raccourci est déjà utilisé par "%@".
ja: このショートカットは「%@」によってすでに使用されています。
ko: 이 단축키는 "%@"에서 이미 사용하고 있습니다.
pt: Este atalho já é usado por "%@".
ru: Этот ярлык уже используется «%@».
tr: Bu kısayol zaten "%@" tarafından kullanılıyor.
zh_hant: 該快速鍵已被“%@”佔用。

# shortcutValidation.missingModifier
source: 快捷键至少需要一个修饰键。
ar: يجب أن يتضمن الاختصار مفتاح تعديل واحدًا على الأقل.
de: Die Verknüpfung muss mindestens eine Zusatztaste enthalten.
en: Shortcut must include at least one modifier key.
es: El acceso directo debe incluir al menos una tecla modificadora.
fr: Le raccourci doit inclure au moins une touche de modification.
ja: ショートカットには少なくとも 1 つの修飾キーが含まれている必要があります。
ko: 단축키에는 최소한 하나의 수정자 키가 포함되어야 합니다.
pt: O atalho deve incluir pelo menos uma tecla modificadora.
ru: Ярлык должен включать хотя бы одну клавишу-модификатор.
tr: Kısayol en az bir değiştirici tuş içermelidir.
zh_hant: 快速鍵至少需要一個修飾鍵。

# shortcutValidation.modifierOnly
source: 快捷键必须包含一个非修饰键。
ar: يجب أن يتضمن الاختصار مفتاحًا غير مفتاح التعديل.
de: Die Tastenkombination muss eine nicht modifizierende Taste enthalten.
en: Shortcut must include a non-modifier key.
es: El acceso directo debe incluir una clave que no sea modificadora.
fr: Le raccourci doit inclure une touche non modificatrice.
ja: ショートカットには非修飾キーが含まれている必要があります。
ko: 단축키에는 수정자 키가 아닌 키가 포함되어야 합니다.
pt: O atalho deve incluir uma tecla não modificadora.
ru: Ярлык должен включать в себя не модифицирующую клавишу.
tr: Kısayol, değiştirici olmayan en az bir tuş içermelidir.
zh_hant: 快速鍵必須包含一個非修飾鍵。

# shortcutValidation.requiredShortcut
source: 该快捷键不能为空。
ar: لا يمكن أن يكون الاختصار فارغًا.
de: Verknüpfung darf nicht leer sein.
en: Shortcut cannot be empty.
es: El acceso directo no puede estar vacío.
fr: Le raccourci ne peut pas être vide.
ja: ショートカットを空にすることはできません。
ko: 바로가기는 비워둘 수 없습니다.
pt: O atalho não pode ficar vazio.
ru: Ярлык не может быть пустым.
tr: Kısayol boş olamaz.
zh_hant: 該快速鍵不能為空。
